Reports/КонтрольКонструкторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КонтрольКонструкторы</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/КонтрольКонструкторы/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем стДанныеОЦвете;

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	тзДанных = ПолучитьТаблицуДанных();
	
	ОписаниеТиповДанных = Новый Массив;
	ОписаниеТиповДанных.Добавить(Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ОписаниеТиповДанных.Добавить(Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплект"));
	ОписаниеТиповДанных.Добавить(Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
    сзКонструкторы 	= ПолучитьКонструкторов(тзДанных);
	
	СтруктураПараметров = омГантСервер.ПолучитьСтруктуруПараметров();
	СтруктураПараметров.ДатаНачалаИнтервала = Период.ДатаНачала;
	СтруктураПараметров.ОписаниеТиповДанных = ОписаниеТиповДанных;
	
	стТаблицыДанных = омГантСервер.ШаблоныТЗДляВыводаГанта(СтруктураПараметров);
	
	СтруктураДобавленияДанных = омГантСервер.ПолучитьСтруктуруДобавленияДанных(СтруктураПараметров);
	
	ДобавитьВТЗ_ГантаКонструкторов(сзКонструкторы, стТаблицыДанных, СтруктураДобавленияДанных, тзДанных);
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСделок(тзДанных, Конструктор)
	мСделки = Новый Массив;
    стОтбор = Новый Структура("Конструктор", Конструктор);
	
	
	Для каждого х Из тзДанных.НайтиСтроки(стОтбор) Цикл
		НайденаяСделка = Неопределено;
		
		Для каждого текСделка Из мСделки Цикл
			Если х.Проект = текСделка.Проект Тогда
				НайденаяСделка = текСделка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденаяСделка = Неопределено Тогда
			стСделки = Новый Структура("Проект, СделкаНаименование, Конструктор, ДатаНачала, ДатаОкончания", 
									   х.Проект, х.СделкаНаименование, х.Конструктор, Дата(1, 1, 1), Дата(1, 1, 1));
			НайденаяСделка = стСделки;
			мСделки.Добавить(НайденаяСделка);
		КонецЕсли;
		
		НайденаяСделка.ДатаОкончания = Макс(НайденаяСделка.ДатаОкончания, х.КрайПКД, х.КрайРКД, х.КрайТЗ);
		
		
		ДатаСравнения = Неопределено;
		
		Если ЗначениеЗаполнено(х.НачалоТЗ) Тогда
			ДатаСравнения = х.НачалоТЗ
		КонецЕсли;
		
		Если ЗначениеЗаполнено(х.КрайРКД) Тогда
			Если ЗначениеЗаполнено(ДатаСравнения) Тогда
				ДатаСравнения = Мин(ДатаСравнения, х.КрайРКД); 
			Иначе
				ДатаСравнения = х.КрайРКД; 
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(х.НачалоПКД) Тогда
			Если ЗначениеЗаполнено(ДатаСравнения) Тогда
				ДатаСравнения = Мин(ДатаСравнения, х.НачалоПКД); 
			Иначе
				ДатаСравнения = х.НачалоПКД; 
			КонецЕсли;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ДатаСравнения) Тогда
			НайденаяСделка.ДатаНачала = ДатаСравнения;	
		КонецЕсли;
		
	КонецЦикла;
	
   Возврат мСделки;
КонецФункции // ПолучитьДанныеСделок()


&НаСервере
Процедура ДобавитьВТЗ_ГантаСделки(тзДанных, РодительНомер, Конструктор, стТаблицыДанных, СтруктураДобавленияДанных)

	мСделки 		= ПолучитьДанныеСделок(тзДанных, Конструктор);
	стТаблицыДанных.ТЗВариантыЗначение = тзОбъектыЦвета.Выгрузить();
	
	Для каждого текСделка Из мСделки Цикл
		Если НЕ ЗначениеЗаполнено(текСделка.Конструктор) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДобавленияДанных.ДанныеДиаграммы 		= текСделка.Проект;
		СтруктураДобавленияДанных.ПредставлениеДанных 	= текСделка.СделкаНаименование;
		СтруктураДобавленияДанных.ДатаНачала 			= текСделка.ДатаНачала;
		СтруктураДобавленияДанных.ДатаОкончания 		= текСделка.ДатаОкончания;
		СтруктураДобавленияДанных.РодительНомер 		= текСделка.Конструктор;
		//СтруктураДобавленияДанных.ЦветФона = ЦветКонструктора;
		
	    омГантСервер.ДобавитьДанныеВТаблицуВыводаГанта(стТаблицыДанных, СтруктураДобавленияДанных);
	КонецЦикла;
	
    омГантСервер.ВывестиДиаграммуГанта(Диаграмма, стТаблицыДанных, СтруктураДобавленияДанных);
КонецПроцедуры // ДобавитьВТЗ_ГантаКонструкторов(сзКонструкторы)


&НаСервере
Процедура ДобавитьВТЗ_ГантаКонструкторов(сзКонструкторы, стТаблицыДанных, СтруктураДобавленияДанных, тзДанных)

	Для каждого текКонструктор Из сзКонструкторы Цикл
		СтруктураДобавленияДанных.ДанныеДиаграммы = текКонструктор.Значение;
		СтруктураДобавленияДанных.ПредставлениеДанных = текКонструктор.Представление;
		
		стНомера = омГантСервер.ДобавитьДанныеВТаблицуВыводаГанта(стТаблицыДанных, СтруктураДобавленияДанных);
		Если Тип("Структура") = ТипЗнч(стНомера) Тогда
			ДобавитьВТЗ_ГантаСделки(тзДанных, стНомера.НомерПоПорядку, текКонструктор.Значение, стТаблицыДанных, СтруктураДобавленияДанных);
		КонецЕсли;
	КонецЦикла;
	
	омГантСервер.ВывестиДиаграммуГанта(Диаграмма, стТаблицыДанных, СтруктураДобавленияДанных);
КонецПроцедуры // ДобавитьВТЗ_ГантаКонструкторов(сзКонструкторы)

&НаСервере
Процедура ЗаполнитьВариантыЗначения(стТаблицыДанных)

	//ТЗВариантыЗначение.Колонки.Добавить("НомерПоПорядку", 			ОписаниеЦелоеЧисло);
	//ТЗВариантыЗначение.Колонки.Добавить("Значение");
	//ТЗВариантыЗначение.Колонки.Добавить("ПредставлениеЗначения", 	ОписаниеСтрока30);
	////При выводе значения сокращать наименование на форме до указанного количество знаков
	////Если 0, то наименование не выводиться, если -1 выводить полностью
	//ТЗВариантыЗначение.Колонки.Добавить("СокращатьНаименованиеДо", 	ОписаниеЦелоеЧисло); 
	//ТЗВариантыЗначение.Колонки.Добавить("ЦветФона", 				Новый ОписаниеТипов("Цвет")); 
	//ТЗВариантыЗначение.Колонки.Добавить("РазмерШрифта", 			ОписаниеЦелоеЧисло);  
	
	

КонецПроцедуры // ЗаполнитьЗначенияИнтервалов(стТаблицыДанных)


&НаСервере
Функция ПолучитьКонструкторов(тзДанных)
	
	сзКонструкторы = Новый СписокЗначений;
	
	Для каждого х Из тзДанных Цикл
		Если сзКонструкторы.НайтиПоЗначению(х.Конструктор) = Неопределено Тогда
			сзКонструкторы.Добавить(х.Конструктор, х.КонструкторНаименование);	
		КонецЕсли;	
	КонецЦикла; 
	
	сзКонструкторы.СортироватьПоПредставлению();
	
	Возврат сзКонструкторы;
	
КонецФункции // ПолучитьКонструкторов()


&НаСервере
Функция ПолучитьТаблицуДанных()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыКомплекта.Комплект КАК Комплект,
		|	ДатыКомплекта.КрайПКД КАК КрайПКД,
		|	ДатыКомплекта.КрайРКД КАК КрайРКД,
		|	ДатыКомплекта.КрайТЗ КАК КрайТЗ,
		|	ДатыКомплекта.НачалоПКД КАК НачалоПКД,
		|	ДатыКомплекта.НачалоРКД КАК НачалоРКД,
		|	ДатыКомплекта.НачалоТЗ КАК НачалоТЗ,
		|	ДатыКомплекта.Проект КАК Проект,
		|	ДатыКомплекта.Комплект.Конструктор КАК Конструктор,
		|	ДатыКомплекта.Комплект.Наименование КАК КомплектНаименование,
		|	ДатыКомплекта.Комплект.Конструктор.Наименование КАК КонструкторНаименование,
		|	ДатыКомплекта.Проект.Номер КАК СделкаНомер,
		|	ДатыКомплекта.Проект.Префикс + "" "" + ДатыКомплекта.Проект.Наименование КАК СделкаНаименование
		|ИЗ
		|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|ГДЕ
		|	(ДатыКомплекта.КрайПКД >= &ДатаН
		|				И ДатыКомплекта.НачалоПКД <= &ДатаК
		|			ИЛИ ДатыКомплекта.КрайРКД >= &ДатаН
		|				И ДатыКомплекта.НачалоРКД <= &ДатаК
		|			ИЛИ ДатыКомплекта.КрайТЗ >= &ДатаН
		|				И ДатыКомплекта.НачалоТЗ <= &ДатаК)";
	
	Запрос.УстановитьПараметр("ДатаК", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаН", Период.ДатаНачала);
	
	тзДанные = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого х Из тзДанные Цикл
	
		х.СделкаНаименование = Формат(х.СделкаНомер, "ЧЦ=3; ЧДЦ=0; ЧВН=") + х.СделкаНаименование;	
	
	КонецЦикла;
	
	Возврат тзДанные;
КонецФункции // ПолучитьТаблицуДанных()


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала 		= ТекущаяДата() - 10 * 24 * 3600;
	Период.ДатаОкончания 	= Период.ДатаНачала + 50 * 24 * 3600;
	
	ЗаполнитьЦвета();
	ОбновитьНаСервере();
КонецПроцедуры 

&НаСервере
Функция ЗаполнитьЦвета()
	мНужныеЗначения = Новый Массив(6);
	мНужныеЗначения[0] = "ТЗ";
	мНужныеЗначения[1] = "РКД";
	мНужныеЗначения[2] = "ПКД";
	мНужныеЗначения[3] = "Проект";
	мНужныеЗначения[4] = "Конструктор";
	мНужныеЗначения[5] = "Сетка";
	
	мОтбор = Новый Массив;
	
	Для каждого х Из мНужныеЗначения Цикл
		ИмяОбъекта = "%" + х;
		Для каждого префикс Из омГантНастройкаСервер.ПолучитьПрефиксыГанта() Цикл
			мОтбор.Добавить(префикс + ИмяОбъекта);
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&мОтбор)";
	
	Запрос.УстановитьПараметр("мОтбор", мОтбор);
	
	стОтбор = Новый Структура("Значение", );
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЦветПоУмолчанию = Новый Цвет(255, 255, 255);

	Пока Выборка.Следующий() Цикл 
		
		
		мПрефиксОбъект = СтрРазделить(Выборка.ИмяНастройки, "%");
		стОтбор.Значение = мПрефиксОбъект[1];
		НайденыеСтроки = тзОбъектыЦвета.НайтиСтроки(стОтбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			НС = тзОбъектыЦвета.Добавить();
			НС.Значение 				= мПрефиксОбъект[1];
			НС.ЦветГанта 				= ЦветПоУмолчанию;
			НС.ПредставлениеГанта 		= мПрефиксОбъект[1];
			НС.РазмерШрифтаГанта		= 8;
		Иначе
		    НС = НайденыеСтроки[0];
		КонецЕсли;
		
		Если мПрефиксОбъект[0] = "ЦветГанта" Тогда 
			Значение = омЦвет.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.Значение);	
		Иначе
			Значение = Выборка.Значение;	
		КонецЕсли;
		
		НС[мПрефиксОбъект[0]] = Значение;
	КонецЦикла;
	
	ЦветПоУмолчанию = Новый Цвет(255, 255, 255);
	
КонецФункции // ЗаполнитьЦвета()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
